2025-02-24-openwrt-dnsmasq.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/rss.xml"
      title="RSS feed for https://martiyo.github.io/"
    />
    <title>dnsmasq en openwrt</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/">/home</a></li>
          <li><a href="https://martiyo.github.io/about">/about</a></li>
          <li><a href="https://martiyo.github.io/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Buscar..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">24 feb 2025</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/2025-02-24-openwrt-dnsmasq.html"
          >dnsmasq en openwrt</a
        >
      </h1>
      <p>Bloquear dominios con <b>dnsmasq</b></p>
      <div id="outline-container-orgfe3d2a6" class="outline-2">
        <h2 id="orgfe3d2a6"># Wiki</h2>
        <div class="outline-text-2" id="text-orgfe3d2a6">
          <p>
            dnsmasq es un redireccionador de DNS ligero y fácil de configurar,
            diseñado para proporcionar servicios DNS (y opcionalmente DHCP y
            TFTP) a una red de pequeña escala. Puede servir los nombres de
            máquinas locales que no están en el DNS global.
          </p>

          <p>
            El servidor DHCP de dnsmasq soporta asignaciones DHCP estáticas y
            dinámicas, múltiples redes y rangos de direcciones IP. El servidor
            DHCP se integra con el servidor DNS y permite que las máquinas
            locales con direcciones asignadas por DHCP aparezcan en el DNS.
            dnsmasq almacena en caché los registros DNS, reduciendo la carga de
            los servidores de nombres de origen y mejorando el rendimiento, y
            puede configurarse para que recoja automáticamente las direcciones
            de sus servidores de origen.
          </p>

          <p>
            dnsmasq acepta peticiones DNS y las responde desde una pequeña caché
            local o las reenvía a un servidor DNS real y recursivo. Carga el
            contenido de /etc/hosts, para que los nombres de hosts locales que
            no aparecen en el DNS global puedan ser resueltos. Esto también
            significa que los registros añadidos al archivo local /etc/hosts con
            el formato "0.0.0.0 annoyingsite.com" pueden ser usados para
            prevenir que las referencias a "annoyingsite.com" sean resueltas por
            el navegador. Esto puede evolucionar rápidamente a un bloqueador de
            anuncios local cuando se combina con proveedores de listas de sitios
            para el bloqueo de anuncios. Si se realiza en el router, puede
            eliminar eficazmente el contenido publicitario de todo un hogar y/o
            empresa.
          </p>
        </div>
      </div>
      <div id="outline-container-orgdafcbbd" class="outline-2">
        <h2 id="orgdafcbbd">
          # Editar el archivo de configuracion de dnsmasq:
        </h2>
        <div class="outline-text-2" id="text-orgdafcbbd">
          <div class="org-src-container">
            <pre class="src src-shell">
vi /etc/dnsmasq.conf 
</pre
            >
          </div>
        </div>
      </div>
      <div id="outline-container-orge3ef87d" class="outline-2">
        <h2 id="orge3ef87d"># Agregar una linea para cada dominios</h2>
        <div class="outline-text-2" id="text-orge3ef87d">
          <div class="org-src-container">
            <pre
              class="src src-shell"
            ><span style="color: #dcaeea;">address</span>=/dominio1.com/0.0.0.0
<span style="color: #dcaeea;">address</span>=/dominio2.com/0.0.0.0
</pre>
          </div>
        </div>
      </div>
      <div id="outline-container-org3cf20ed" class="outline-2">
        <h2 id="org3cf20ed">
          # Reiniciar el servicion para aplicar los cambios
        </h2>
        <div class="outline-text-2" id="text-org3cf20ed">
          <div class="org-src-container">
            <pre class="src src-shell">
/etc/init.d/dnsmasq restart
</pre
            >
          </div>
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/tag-openwrt.html">openwrt</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
